# Dataframe from List

In [59]:
import pandas as pd

In [147]:
data0 = [
    {'a' : 0, 'b' : 1, 'c': 3},
    {'a' : -1, 'b' : 1, 'c': 3},
    {'a' : -2, 'b' : 1, 'c': 3}
        ]

In [148]:
d0 = pd.DataFrame(data0)

In [149]:
d0

   a  b  c
0  0  1  3
1 -1  1  3
2 -2  1  3

# Dataframe from Dicts

In [60]:
data = {"name":["yahoo","google","facebook"], "marks":[200,400,800], "price":[9, 3, 7]}

In [61]:
d1 = pd.DataFrame(data)

In [62]:
d1

   marks      name  price
0    200     yahoo      9
1    400    google      3
2    800  facebook      7

## notice that the column is not sort in data

In [63]:
d2 = pd.DataFrame(data, columns=['name','price','marks'])

In [64]:
d2

       name  price  marks
0     yahoo      9    200
1    google      3    400
2  facebook      7    800

# define index

### the index number should as large as data, not like columns

In [65]:
d3 = pd.DataFrame(data, columns=['name', 'price', 'marks', 'debt'], index=['a','b','c'])

In [66]:
d3

       name  price  marks debt
a     yahoo      9    200  NaN
b    google      3    400  NaN
c  facebook      7    800  NaN

In [67]:
d3.columns

Index([u'name', u'price', u'marks', u'debt'], dtype='object')

In [68]:
type(d3.columns)

pandas.indexes.base.Index

In [69]:
d3.index

Index([u'a', u'b', u'c'], dtype='object')

# get one column

In [70]:
d3['name']

a       yahoo
b      google
c    facebook
Name: name, dtype: object

In [150]:
d3.name

a       yahoo
b      google
c    facebook
Name: name, dtype: object

In [71]:
type(d2['name'])

pandas.core.series.Series

In [72]:
d3['debt'] = 80

In [73]:
d3

       name  price  marks  debt
a     yahoo      9    200    80
b    google      3    400    80
c  facebook      7    800    80

In [74]:
sdebt = pd.Series([2.2, 3.3], index=["a","d"])

In [75]:
d3['debt'] = sdebt

In [76]:
d3

       name  price  marks  debt
a     yahoo      9    200   2.2
b    google      3    400   NaN
c  facebook      7    800   NaN

# set value
## index, column, value

In [78]:
d3

       name  price  marks  debt
a     yahoo    100    200   2.2
b    google      3    400   NaN
c  facebook      7    800   NaN

In [79]:
d3.set_value('b', 'price', 15)

       name  price  marks  debt
a     yahoo    100    200   2.2
b    google     15    400   NaN
c  facebook      7    800   NaN

# sort data

In [91]:
d3.sort_values(by='price')

       name  price  marks  debt
c  facebook      7    800   NaN
b    google     15    400   NaN
a     yahoo    100    200   2.2

In [89]:
d3

       name  price  marks  debt
a     yahoo    100    200   2.2
b    google     15    400   NaN
c  facebook      7    800   NaN

# read csv

## marks.csv
```
name,physics,python,math,english

Google,100,100,25,12

Facebook,45,54,44,88

Twitter,54,76,13,91

Yahoo,54,452,26,100
```

In [93]:
marks = pd.read_csv("marks.csv")

In [94]:
marks

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

# shape size

In [262]:
d3.shape

(3, 4)

# select data

In [83]:
d3[(d3['price'] > 10) & (d3['marks'] < 300)]

    name  price  marks  debt
a  yahoo    100    200   2.2

In [100]:
marks[1:3]

       name  physics  python  math  english
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91

In [102]:
d3

       name  price  marks  debt
a     yahoo    100    200   2.2
b    google     15    400   NaN
c  facebook      7    800   NaN

In [156]:
d3.iloc[0]

name     yahoo
price      100
marks      200
debt       2.2
Name: a, dtype: object

In [185]:
d3.iloc[-1]

name     facebook
price           7
marks         800
debt          NaN
Name: c, dtype: object

In [160]:
d3.iloc[0:2]

     name  price  marks  debt
a   yahoo    100    200   2.2
b  google     15    400   NaN

In [167]:
d3.iloc[0:2, 0:2]

     name  price
a   yahoo    100
b  google     15

In [173]:
d3.iloc[0:2, [0,2]]

     name  marks
a   yahoo    200
b  google    400

In [266]:
d3.iloc[:, [0,1]]

       name  price
a     Yahoo    100
b    google     15
c  facebook      7

In [159]:
d3.loc['a']

name     yahoo
price      100
marks      200
debt       2.2
Name: a, dtype: object

In [161]:
d3.loc['a':'b']

     name  price  marks  debt
a   yahoo    100    200   2.2
b  google     15    400   NaN

In [165]:
d3.loc['a':'b', 'name':'price']

     name  price
a   yahoo    100
b  google     15

In [172]:
d3.loc['a':'b', ['name', 'marks']]

     name  marks
a   yahoo    200
b  google    400

In [174]:
d3.loc[:, ['name', 'marks']]

       name  marks
a     yahoo    200
b    google    400
c  facebook    800

## ix虽然可以替代iloc和loc，但是有时会有歧义，需要注意使用

In [175]:
d3.ix['a']

d3.ix['a':'b']

d3.ix['a':'b', 'name':'price']

d3.ix['a':'b', ['name', 'marks']]

d3.ix[:, ['name', 'marks']]

d3.ix[0]

d3.ix[0:2]

d3.ix[0:2, 0:2]

d3.ix[0:2, [0,2]]

name     yahoo
price      100
marks      200
debt       2.2
Name: a, dtype: object

# update data

## loc iloc ix

In [223]:
d3

       name  price  marks  debt
a     yahoo    100    200   2.2
b    google     15    400   NaN
c  facebook      7    800   NaN

In [226]:
d3.ix[0, 'name'] = 'Yahoo'

In [227]:
d3

       name  price  marks  debt
a     Yahoo    100    200   2.2
b    google     15    400   NaN
c  facebook      7    800   NaN

## apply

In [111]:
marks

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

In [121]:
def total(tmp):
    return tmp ** 2

In [134]:
marks = marks.assign(total=marks.math.apply(total))

In [135]:
marks

       name  physics  python  math  english  total
0    Google      100     100    25       12    625
1  Facebook       45      54    44       88   1936
2   Twitter       54      76    13       91    169
3     Yahoo       54     452    26      100    676

In [137]:
marks['total'] = marks.apply(lambda row : total(row['math']), axis=1)

In [138]:
marks

       name  physics  python  math  english  total
0    Google      100     100    25       12    625
1  Facebook       45      54    44       88   1936
2   Twitter       54      76    13       91    169
3     Yahoo       54     452    26      100    676

In [139]:
def get_total(row):
    return row['physics'] + row['python'] + row['math'] + row['english']

In [144]:
marks.apply(get_total, axis=1)

0    237
1    231
2    234
3    632
dtype: int64

In [141]:
marks['total'] = marks.apply(get_total, axis=1)

In [143]:
marks

       name  physics  python  math  english  total
0    Google      100     100    25       12    237
1  Facebook       45      54    44       88    231
2   Twitter       54      76    13       91    234
3     Yahoo       54     452    26      100    632

## delete column

In [136]:
marks = marks.drop('total', axis=1)
marks

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

In [154]:
del marks['math']
marks

       name  physics  python  english  total
0    Google      100     100       12    237
1  Facebook       45      54       88    231
2   Twitter       54      76       91    234
3     Yahoo       54     452      100    632

# append

In [196]:
marks = marks.append(marks.iloc[-1])

In [198]:
marks

       name  physics  python  english  total_score
0    Google      100     100       12          237
1  Facebook       45      54       88          231
2   Twitter       54      76       91          234
3     Yahoo       54     452      100          632
3     Yahoo       54     452      100          632

In [199]:
marks = marks.append(marks.iloc[1:2])
marks

       name  physics  python  english  total_score
0    Google      100     100       12          237
1  Facebook       45      54       88          231
2   Twitter       54      76       91          234
3     Yahoo       54     452      100          632
3     Yahoo       54     452      100          632
1  Facebook       45      54       88          231

### loc的返回值可能是Dataframe或Series

In [205]:
print type(marks.loc[0])
print type(marks.loc[1])

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [221]:
marks.duplicated('name')

0    False
1    False
2    False
3    False
3     True
1    False
dtype: bool

In [217]:
marks.iloc[-1, 0] = 'facebook'

In [218]:
marks

       name  physics  python  english  total_score
0    Google      100     101       12          237
1  Facebook       45      54       88          231
2   Twitter       54      76       91          234
3     Yahoo       54     452      100          632
3     Yahoo       54     452      100          632
1  facebook       45      54       88          231

In [220]:
marks.duplicated('name')

0    False
1    False
2    False
3    False
3     True
1    False
dtype: bool

In [271]:
marks.drop_duplicates('physics')

       name  physics  python  english  total_score
0    Google      100     101       12          237
1  Facebook       45      54       88          231
2   Twitter       54      76       91          234

# unique

In [230]:
marks.name.unique()

array(['Google', 'Facebook', 'Twitter', 'Yahoo', 'facebook'], dtype=object)

# rename

In [186]:
marks

       name  physics  python  english  total
0    Google      100     100       12    237
1  Facebook       45      54       88    231
2   Twitter       54      76       91    234
3     Yahoo       54     452      100    632

In [187]:
marks.rename(columns = {'total':'total_score'},inplace=True)

In [188]:
marks

       name  physics  python  english  total_score
0    Google      100     100       12          237
1  Facebook       45      54       88          231
2   Twitter       54      76       91          234
3     Yahoo       54     452      100          632

# change a row to list

In [241]:
row = list(marks.iloc[0].values)
row

['Google', 100, 101, 12, 237]

# merge

In [257]:
m1 = marks[0:3]
m2 = pd.DataFrame(
    { 'name':['Google', 'Sohu'],
    'Chinese':[99, 98]}
)
m3 = pd.DataFrame(
    { 'name':['Google', 'Sohu'],
    'Chinese':[99, 98],
    'python':[101, 97]}
)

In [253]:
m2

   Chinese    name
0       99  Google
1       98    Sohu

In [258]:
m3

   Chinese    name  python
0       99  Google     101
1       98    Sohu      97

## merge 对于相同的column会分别重命名为_x,_y,即使他们的值是一样的

In [254]:
m1.merge(m2, how='left', on='name')

       name  physics  python  english  total_score  Chinese
0    Google      100     101       12          237     99.0
1  Facebook       45      54       88          231      NaN
2   Twitter       54      76       91          234      NaN

In [255]:
m1.merge(m2, how='inner', on='name')

     name  physics  python  english  total_score  Chinese
0  Google      100     101       12          237       99

In [256]:
m1.merge(m2, how='right', on='name')

     name  physics  python  english  total_score  Chinese
0  Google    100.0   101.0     12.0        237.0       99
1    Sohu      NaN     NaN      NaN          NaN       98

In [259]:
m1.merge(m3, how='left', on='name')

       name  physics  python_x  english  total_score  Chinese  python_y
0    Google      100       101       12          237     99.0     101.0
1  Facebook       45        54       88          231      NaN       NaN
2   Twitter       54        76       91          234      NaN       NaN

In [260]:
m1.merge(m3, how='inner', on='name')

     name  physics  python_x  english  total_score  Chinese  python_y
0  Google      100       101       12          237       99       101

In [261]:
m1.merge(m3, how='right', on='name')

     name  physics  python_x  english  total_score  Chinese  python_y
0  Google    100.0     101.0     12.0        237.0       99       101
1    Sohu      NaN       NaN      NaN          NaN       98        97

# save and format excel

In [146]:
writer = pd.ExcelWriter('file_name.xlsx', 
                        engine='xlsxwriter',
                        options={'strings_to_urls': False},
                        datetime_format='yyyy mmm d hh:mm:ss',
                        date_format='yyyy mmmm dd')
marks.to_excel(writer, index=False, sheet_name='sheet_name', startrow=0)

workbook = writer.book
format1 = workbook.add_format()
format1.set_num_format('0.00%')
start_column = end_column = 0
width = 10
worksheet = writer.sheets['sheet_name']
worksheet.set_column(start_column, end_column, width, format1)

writer.save()